n = input() # учитамо стринг из првог реда
n = int(n) # преведемо стринг у цео број
#n = int(input()) # претходне две команде се обично спајају у ову једну

a = input() # учитамо стринг из другог реда
a = a.split() # поделимо стринг као реченицу у листу речи
a = map(int, a) # применићемо int на стрингове из листе
a = list(a) # преведемо итератор map у листу
#a = list(map(int, input().split())) # претходне четири команде спојене у једну

b = ans = 0 # доделимо двема променљивама исту вредност
c = [1, 0] # бројимо колико пута је b имало вредности 0 и 1
for x in a: # за сваки елеменат x урадимо команде померене удесно које чине петљу
	b ^= x # саберемо остатке по модулу 2
	ans += c[b] # додамо нове сегменте који се завршавају овде
	c[b] += 1 # повећамо број појављивања стања b за 1

print(ans) # исписујемо решење
